console.clear();

// ## 0 Подключение файла script.js
//
// * Подключите этот файл в index.js
// * Выведете в консоли фразу Hello world!



// ## 1 Обьявление примитивных переменные
//
// * Обьявите 5 примитивных типов переменных, которые доступны в Javascript.
// * Присвойте им значения на свое усмотрение
// * Проверьте валидность кода через парсер


// ## 2 Математические операции
//
// Создайте три переменные (стороны угла треугольник) с типом Number с значениями 4, 5, 9
// * Найдите периметр треугольника
// * Найдите полупериметр треугольника
// * Найдите радиус вписанной окружности в треугольник
// * Найдите радиус вписанной окружности в прямоугольный треугольник
// Результат всех четырех вычислений выведете в консоль с помошью функции console.info() с описанием расчета
// Пример вывода в консоли: Square = 20



// ## 3 Названия переменных
//
// Создайте 5 пустых переменных и придумайте им "корректные" названия
// * Переменная для названия емейла пользователя
// * Переменная для текущей даты
// * Переменная для массива фамилий пользователей
// * Переменная для значения "по умолчанию"
// * Переменная которая описывала б значение правой верхней границы html элемента



// ## 4 Работа с обьектами
//
// * Создайте обьект ""Пользователь" (С корректным названием) с ключем user и значением "Вася"
// * Измените значение ключа на "Петя"
// * Выведите в консоли значение ключа обьекта из файла index.html


// ## Преобразование типов
//
// Обьясните почему консоль выводит такой результат. Ответ запишите в комментарии напротив строки

console.info('6' - 3);
console.info('20' + 10);
console.info('10' + - 2);
console.info("4px" - 2);
console.info(15 / 0);
console.info(4 + 5 + "px");
console.info(+"");
console.info(NaN === NaN);
console.info(null == undefined);
