console.clear();

// ## 0 Конструкторы и обьекты
//
// Цель: Создать 4 персононажей из "Братства кольца"
// Каждый персонаж будет иметь 5 свойств (Имя, Оружие - принимаемые аргумент, Интелект, Сила, Ловкость - задаются по умолчанию как 10)
// ** Создайте класс\конструктор Character который будет создавать персонажа (Без рассы)
// ** Конструктор принимает имя персонажа и создает обьект с 3я свойствами по умолчанию (Все зачения = 10)
// Создайте 3 дочерних конструктора (Elf, Gnome, Human)
// Конструкторы наследуют значения родителя Character
// У каждого дочернего класса есть своя особенность
// Наприемер
// Ельф на 20% более ловкий и на 15% менее сильный
// Человек на 10% больше интелекта и на 10% уступает в ловкости
// Гном на 30% сильнее и на 20% менее умен



// * Your code Start *



// * Your code End *
